MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB610/mcu.h
#define IPC29 IPC29
extern volatile uint16_t IPC29 __attribute__((__sfr__));
__extension__ typedef struct tagIPC29BITS {
  union {
    struct {
      uint16_t U6ERIP:3;
      uint16_t :1;
      uint16_t JTAGIP:3;
    };
    struct {
      uint16_t U6ERIP0:1;
      uint16_t U6ERIP1:1;
      uint16_t U6ERIP2:1;
      uint16_t :1;
      uint16_t JTAGIP0:1;
      uint16_t JTAGIP1:1;
      uint16_t JTAGIP2:1;
    };
  };
} IPC29BITS;
extern volatile IPC29BITS IPC29bits __attribute__((__sfr__));

#define INTTREG INTTREG
extern volatile uint16_t INTTREG __attribute__((__sfr__));
__extension__ typedef struct tagINTTREGBITS {
  union {
    struct {
      uint16_t VECNUM:8;
      uint16_t ILR:4;
      uint16_t :1;
      uint16_t VHOLD:1;
      uint16_t :1;
      uint16_t CPUIRQ:1;
    };
    struct {
      uint16_t VECNUM0:1;
      uint16_t VECNUM1:1;
      uint16_t VECNUM2:1;
      uint16_t VECNUM3:1;
      uint16_t VECNUM4:1;
      uint16_t VECNUM5:1;
      uint16_t VECNUM6:1;
      uint16_t VECNUM7:1;
      uint16_t ILR0:1;
      uint16_t ILR1:1;
      uint16_t ILR2:1;
      uint16_t ILR3:1;
    };
  };
} INTTREGBITS;
extern volatile INTTREGBITS INTTREGbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile uint16_t OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      uint16_t OSWEN:1;
      uint16_t SOSCEN:1;
      uint16_t POSCEN:1;
      uint16_t CF:1;
      uint16_t :1;
      uint16_t LOCK:1;
      uint16_t IOLOCK:1;
      uint16_t CLKLOCK:1;
      uint16_t NOSC:3;
      uint16_t :1;
      uint16_t COSC:3;
    };
    struct {
      uint16_t :8;
      uint16_t NOSC0:1;
      uint16_t NOSC1:1;
      uint16_t NOSC2:1;
      uint16_t :1;
      uint16_t COSC0:1;
      uint16_t COSC1:1;
      uint16_t COSC2:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

#define OSCCONL OSCCONL
extern volatile uint8_t OSCCONL __attribute__((__sfr__));
#define OSCCONH OSCCONH
extern volatile uint8_t OSCCONH __attribute__((__sfr__));
#define CLKDIV CLKDIV
extern volatile uint16_t CLKDIV __attribute__((__sfr__));
__extension__ typedef struct tagCLKDIVBITS {
  union {
    struct {
      uint16_t :5;
      uint16_t PLLEN:1;
      uint16_t CPDIV:2;
      uint16_t RCDIV:3;
      uint16_t DOZEN:1;
      uint16_t DOZE:3;
      uint16_t ROI:1;
    };
    struct {
      uint16_t :6;
      uint16_t CPDIV0:1;
      uint16_t CPDIV1:1;
      uint16_t RCDIV0:1;
      uint16_t RCDIV1:1;
      uint16_t RCDIV2:1;
      uint16_t :1;
      uint16_t DOZE0:1;
      uint16_t DOZE1:1;
      uint16_t DOZE2:1;
    };
  };
} CLKDIVBITS;
extern volatile CLKDIVBITS CLKDIVbits __attribute__((__sfr__));

#define OSCTUN OSCTUN
extern volatile uint16_t OSCTUN __attribute__((__sfr__));
__extension__ typedef struct tagOSCTUNBITS {
  union {
    struct {
      uint16_t TUN:6;
      uint16_t :2;
      uint16_t STORPOL:1;
      uint16_t STOR:1;
      uint16_t STLPOL:1;
      uint16_t STLOCK:1;
      uint16_t STSRC:1;
      uint16_t STSIDL:1;
      uint16_t :1;
      uint16_t STEN:1;
    };
    struct {
      uint16_t TUN0:1;
      uint16_t TUN1:1;
      uint16_t TUN2:1;
      uint16_t TUN3:1;
      uint16_t TUN4:1;
      uint16_t TUN5:1;
    };
  };
} OSCTUNBITS;
extern volatile OSCTUNBITS OSCTUNbits __attribute__((__sfr__));

#define DCOTUN DCOTUN
extern volatile uint16_t DCOTUN __attribute__((__sfr__));
__extension__ typedef struct tagDCOTUNBITS {
  union {
    struct {
      uint16_t DCOTUN:6;
    };
    struct {
      uint16_t TUN0:1;
      uint16_t TUN1:1;
      uint16_t TUN2:1;
      uint16_t TUN3:1;
      uint16_t TUN4:1;
      uint16_t TUN5:1;
    };
  };
} DCOTUNBITS;
extern volatile DCOTUNBITS DCOTUNbits __attribute__((__sfr__));

#define DCOCON DCOCON
extern volatile uint16_t DCOCON __attribute__((__sfr__));
__extension__ typedef struct tagDCOCONBITS {
  union {
    struct {
      uint16_t :8;
      uint16_t DCOFSEL:4;
      uint16_t :1;
      uint16_t DCOEN:1;
    };
    struct {
      uint16_t :8;
      uint16_t DCOFSEL0:1;
      uint16_t DCOFSEL1:1;
      uint16_t DCOFSEL2:1;
      uint16_t DCOFSEL3:1;
    };
  };
} DCOCONBITS;
extern volatile DCOCONBITS DCOCONbits __attribute__((__sfr__));

#define OSCDIV OSCDIV
extern volatile uint16_t OSCDIV __attribute__((__sfr__));
__extension__ typedef struct tagOSCDIVBITS {
  union {
    struct {
      uint16_t DIV:15;
    };
    struct {
      uint16_t DIV0:1;
      uint16_t DIV1:1;
      uint16_t DIV2:1;
      uint16_t DIV3:1;
      uint16_t DIV4:1;
      uint16_t DIV5:1;
      uint16_t DIV6:1;
      uint16_t DIV7:1;
      uint16_t DIV8:1;
      uint16_t DIV9:1;
      uint16_t DIV10:1;
      uint16_t DIV11:1;
      uint16_t DIV12:1;
      uint16_t DIV13:1;
      uint16_t DIV14:1;
    };
  };
} OSCDIVBITS;
extern volatile OSCDIVBITS OSCDIVbits __attribute__((__sfr__));

#define OSCFDIV OSCFDIV
extern volatile uint16_t OSCFDIV __attribute__((__sfr__));
__extension__ typedef struct tagOSCFDIVBITS {
  union {
    struct {
      uint16_t :7;
      uint16_t TRIM:9;
    };
    struct {
      uint16_t :7;
      uint16_t TRIM8:1;
      uint16_t TRIM7:1;
      uint16_t TRIM6:1;
      uint16_t TRIM5:1;
      uint16_t TRIM4:1;
      uint16_t TRIM3:1;
      uint16_t TRIM2:1;
      uint16_t TRIM1:1;
      uint16_t TRIM0:1;
    };
  };
} OSCFDIVBITS;
extern volatile OSCFDIVBITS OSCFDIVbits __attribute__((__sfr__));

#define RCON RCON
extern volatile uint16_t RCON __attribute__((__sfr__));
__extension__ typedef struct tagRCONBITS {
  union {
    struct {
      uint16_t POR:1;
      uint16_t BOR:1;
      uint16_t IDLE:1;
      uint16_t SLEEP:1;
      uint16_t WDTO:1;
      uint16_t SWDTEN:1;
      uint16_t SWR:1;
      uint16_t EXTR:1;
      uint16_t VREGS:1;
      uint16_t CM:1;
      uint16_t :2;
      uint16_t RETEN:1;
      uint16_t SBOREN:1;
      uint16_t IOPUWR:1;
      uint16_t TRAPR:1;
    };
    struct {
      uint16_t :8;
      uint16_t PMSLP:1;
    };
  };
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define HLVDCON HLVDCON
extern volatile uint16_t HLVDCON __attribute__((__sfr__));
__extension__ typedef struct tagHLVDCONBITS {
  union {
    struct {
      uint16_t HLVDL:4;
      uint16_t :4;
      uint16_t LVDEVT:1;
      uint16_t IRVST:1;
      uint16_t BGVST:1;
      uint16_t VDIR:1;
      uint16_t :1;
      uint16_t LSIDL:1;
      uint16_t :1;
      uint16_t HLVDEN:1;
    };
    struct {
      uint16_t HLVDL0:1;
      uint16_t HLVDL1:1;
      uint16_t HLVDL2:1;
      uint16_t HLVDL3:1;
    };
  };
} HLVDCONBITS;
