MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB610/mcu.h
#define CRCCON1 CRCCON1
extern volatile uint16_t CRCCON1 __attribute__((__sfr__));
__extension__ typedef struct tagCRCCON1BITS {
  union {
    struct {
      uint16_t :3;
      uint16_t LENDIAN:1;
      uint16_t CRCGO:1;
      uint16_t CRCISEL:1;
      uint16_t CRCMPT:1;
      uint16_t CRCFUL:1;
      uint16_t VWORD:5;
      uint16_t CSIDL:1;
      uint16_t :1;
      uint16_t CRCEN:1;
    };
    struct {
      uint16_t :8;
      uint16_t VWORD0:1;
      uint16_t VWORD1:1;
      uint16_t VWORD2:1;
      uint16_t VWORD3:1;
      uint16_t VWORD4:1;
    };
  };
} CRCCON1BITS;
extern volatile CRCCON1BITS CRCCON1bits __attribute__((__sfr__));

#define CRCCON2 CRCCON2
extern volatile uint16_t CRCCON2 __attribute__((__sfr__));
__extension__ typedef struct tagCRCCON2BITS {
  union {
    struct {
      uint16_t PLEN:5;
      uint16_t :3;
      uint16_t DWIDTH:5;
    };
    struct {
      uint16_t PLEN0:1;
      uint16_t PLEN1:1;
      uint16_t PLEN2:1;
      uint16_t PLEN3:1;
      uint16_t PLEN4:1;
      uint16_t :3;
      uint16_t DWIDTH0:1;
      uint16_t DWIDTH1:1;
      uint16_t DWIDTH2:1;
      uint16_t DWIDTH3:1;
      uint16_t DWIDTH4:1;
    };
  };
} CRCCON2BITS;
extern volatile CRCCON2BITS CRCCON2bits __attribute__((__sfr__));

#define CRCXORL CRCXORL
extern volatile uint16_t CRCXORL __attribute__((__sfr__));
typedef struct tagCRCXORLBITS {
  uint16_t :1;
  uint16_t X1:1;
  uint16_t X2:1;
  uint16_t X3:1;
  uint16_t X4:1;
  uint16_t X5:1;
  uint16_t X6:1;
  uint16_t X7:1;
  uint16_t X8:1;
  uint16_t X9:1;
  uint16_t X10:1;
  uint16_t X11:1;
  uint16_t X12:1;
  uint16_t X13:1;
  uint16_t X14:1;
  uint16_t X15:1;
} CRCXORLBITS;
extern volatile CRCXORLBITS CRCXORLbits __attribute__((__sfr__));

#define CRCXORH CRCXORH
extern volatile uint16_t CRCXORH __attribute__((__sfr__));
typedef struct tagCRCXORHBITS {
  uint16_t X16:1;
  uint16_t X17:1;
  uint16_t X18:1;
  uint16_t X19:1;
  uint16_t X20:1;
  uint16_t X21:1;
  uint16_t X22:1;
  uint16_t X23:1;
  uint16_t X24:1;
  uint16_t X25:1;
  uint16_t X26:1;
  uint16_t X27:1;
  uint16_t X28:1;
  uint16_t X29:1;
  uint16_t X30:1;
  uint16_t X31:1;
} CRCXORHBITS;
extern volatile CRCXORHBITS CRCXORHbits __attribute__((__sfr__));

#define CRCDAT CRCDAT
extern volatile uint16_t CRCDAT __attribute__((__sfr__));
#define CRCDATL CRCDATL
extern volatile uint16_t CRCDATL __attribute__((__sfr__));
#define CRCDATH CRCDATH
extern volatile uint16_t CRCDATH __attribute__((__sfr__));
#define CRCWDAT CRCWDAT
extern volatile uint16_t CRCWDAT __attribute__((__sfr__));
#define CRCWDATL CRCWDATL
extern volatile uint16_t CRCWDATL __attribute__((__sfr__));
#define CRCWDATH CRCWDATH
extern volatile uint16_t CRCWDATH __attribute__((__sfr__));
#define REFOCON1 REFOCON1
extern volatile uint16_t REFOCON1 __attribute__((__sfr__));
__extension__ typedef struct tagREFOCON1BITS {
  union {
    struct {
      uint16_t ROSEL:4;
      uint16_t :4;
      uint16_t ROACTIVE:1;
      uint16_t ROSWEN:1;
      uint16_t :1;
      uint16_t ROSLP:1;
      uint16_t ROOUT:1;
      uint16_t ROSIDL:1;
      uint16_t :1;
      uint16_t ROEN:1;
    };
    struct {
      uint16_t ROSEL0:1;
      uint16_t ROSEL1:1;
      uint16_t ROSEL2:1;
      uint16_t ROSEL3:1;
    };
  };
} REFOCON1BITS;
extern volatile REFOCON1BITS REFOCON1bits __attribute__((__sfr__));

#define REFOCONL REFOCONL
extern volatile uint16_t REFOCONL __attribute__((__sfr__));
__extension__ typedef struct tagREFOCONLBITS {
  union {
    struct {
      uint16_t ROSEL:4;
      uint16_t :4;
      uint16_t ROACTIVE:1;
      uint16_t ROSWEN:1;
      uint16_t :1;
      uint16_t ROSLP:1;
      uint16_t ROOUT:1;
      uint16_t ROSIDL:1;
      uint16_t :1;
      uint16_t ROEN:1;
    };
    struct {
      uint16_t ROSEL0:1;
      uint16_t ROSEL1:1;
      uint16_t ROSEL2:1;
      uint16_t ROSEL3:1;
    };
  };
} REFOCONLBITS;
extern volatile REFOCONLBITS REFOCONLbits __attribute__((__sfr__));

#define REFOCON2 REFOCON2
extern volatile uint16_t REFOCON2 __attribute__((__sfr__));
__extension__ typedef struct tagREFOCON2BITS {
  union {
    struct {
      uint16_t RODIV:15;
    };
    struct {
      uint16_t RODIV0:1;
      uint16_t RODIV1:1;
      uint16_t RODIV2:1;
      uint16_t RODIV3:1;
      uint16_t RODIV4:1;
      uint16_t RODIV5:1;
      uint16_t RODIV6:1;
      uint16_t RODIV7:1;
      uint16_t RODIV8:1;
      uint16_t RODIV9:1;
      uint16_t RODIV10:1;
      uint16_t RODIV11:1;
      uint16_t RODIV12:1;
      uint16_t RODIV13:1;
      uint16_t RODIV14:1;
    };
  };
} REFOCON2BITS;
extern volatile REFOCON2BITS REFOCON2bits __attribute__((__sfr__));

#define REFOCONH REFOCONH
extern volatile uint16_t REFOCONH __attribute__((__sfr__));
__extension__ typedef struct tagREFOCONHBITS {
  union {
    struct {
      uint16_t RODIV:15;
    };
    struct {
      uint16_t RODIV0:1;
      uint16_t RODIV1:1;
      uint16_t RODIV2:1;
      uint16_t RODIV3:1;
      uint16_t RODIV4:1;
      uint16_t RODIV5:1;
      uint16_t RODIV6:1;
      uint16_t RODIV7:1;
      uint16_t RODIV8:1;
      uint16_t RODIV9:1;
      uint16_t RODIV10:1;
      uint16_t RODIV11:1;
      uint16_t RODIV12:1;
      uint16_t RODIV13:1;
      uint16_t RODIV14:1;
    };
  };
} REFOCONHBITS;
extern volatile REFOCONHBITS REFOCONHbits __attribute__((__sfr__));

#define PMD1 PMD1
extern volatile uint16_t PMD1 __attribute__((__sfr__));
typedef struct tagPMD1BITS {
  uint16_t AD1MD:1;
  uint16_t :2;
  uint16_t SPI1MD:1;
  uint16_t SPI2MD:1;
  uint16_t U1MD:1;
  uint16_t U2MD:1;
  uint16_t I2C1MD:1;
  uint16_t :3;
  uint16_t T1MD:1;
  uint16_t T2MD:1;
  uint16_t T3MD:1;
  uint16_t T4MD:1;
  uint16_t T5MD:1;
} PMD1BITS;
extern volatile PMD1BITS PMD1bits __attribute__((__sfr__));

#define PMD2 PMD2
extern volatile uint16_t PMD2 __attribute__((__sfr__));
typedef struct tagPMD2BITS {
  uint16_t OC1MD:1;
  uint16_t OC2MD:1;
  uint16_t OC3MD:1;
  uint16_t OC4MD:1;
  uint16_t OC5MD:1;
  uint16_t OC6MD:1;
  uint16_t OC7MD:1;
  uint16_t OC8MD:1;
  uint16_t IC1MD:1;
  uint16_t IC2MD:1;
  uint16_t IC3MD:1;
  uint16_t IC4MD:1;
  uint16_t IC5MD:1;
  uint16_t IC6MD:1;
  uint16_t IC7MD:1;
  uint16_t IC8MD:1;
} PMD2BITS;
extern volatile PMD2BITS PMD2bits __attribute__((__sfr__));

#define PMD3 PMD3
extern volatile uint16_t PMD3 __attribute__((__sfr__));
typedef struct tagPMD3BITS {
  uint16_t :1;
  uint16_t I2C2MD:1;
  uint16_t I2C3MD:1;
  uint16_t U3MD:1;
  uint16_t :3;
  uint16_t CRCMD:1;
  uint16_t PMPMD:1;
  uint16_t RTCCMD:1;
  uint16_t CMPMD:1;
} PMD3BITS;
extern volatile PMD3BITS PMD3bits __attribute__((__sfr__));

