MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB610/mcu.h
#define _OSCTUN_TUN2_POSITION                    0x00000002
#define _OSCTUN_TUN2_MASK                        0x00000004
#define _OSCTUN_TUN2_LENGTH                      0x00000001

#define _OSCTUN_TUN3_POSITION                    0x00000003
#define _OSCTUN_TUN3_MASK                        0x00000008
#define _OSCTUN_TUN3_LENGTH                      0x00000001

#define _OSCTUN_TUN4_POSITION                    0x00000004
#define _OSCTUN_TUN4_MASK                        0x00000010
#define _OSCTUN_TUN4_LENGTH                      0x00000001

#define _OSCTUN_TUN5_POSITION                    0x00000005
#define _OSCTUN_TUN5_MASK                        0x00000020
#define _OSCTUN_TUN5_LENGTH                      0x00000001

#define _DCOTUN_DCOTUN_POSITION                  0x00000000
#define _DCOTUN_DCOTUN_MASK                      0x0000003F
#define _DCOTUN_DCOTUN_LENGTH                    0x00000006

#define _DCOTUN_TUN0_POSITION                    0x00000000
#define _DCOTUN_TUN0_MASK                        0x00000001
#define _DCOTUN_TUN0_LENGTH                      0x00000001

#define _DCOTUN_TUN1_POSITION                    0x00000001
#define _DCOTUN_TUN1_MASK                        0x00000002
#define _DCOTUN_TUN1_LENGTH                      0x00000001

#define _DCOTUN_TUN2_POSITION                    0x00000002
#define _DCOTUN_TUN2_MASK                        0x00000004
#define _DCOTUN_TUN2_LENGTH                      0x00000001

#define _DCOTUN_TUN3_POSITION                    0x00000003
#define _DCOTUN_TUN3_MASK                        0x00000008
#define _DCOTUN_TUN3_LENGTH                      0x00000001

#define _DCOTUN_TUN4_POSITION                    0x00000004
#define _DCOTUN_TUN4_MASK                        0x00000010
#define _DCOTUN_TUN4_LENGTH                      0x00000001

#define _DCOTUN_TUN5_POSITION                    0x00000005
#define _DCOTUN_TUN5_MASK                        0x00000020
#define _DCOTUN_TUN5_LENGTH                      0x00000001

#define _DCOCON_DCOFSEL_POSITION                 0x00000008
#define _DCOCON_DCOFSEL_MASK                     0x00000F00
#define _DCOCON_DCOFSEL_LENGTH                   0x00000004

#define _DCOCON_DCOEN_POSITION                   0x0000000D
#define _DCOCON_DCOEN_MASK                       0x00002000
#define _DCOCON_DCOEN_LENGTH                     0x00000001

#define _DCOCON_DCOFSEL0_POSITION                0x00000008
#define _DCOCON_DCOFSEL0_MASK                    0x00000100
#define _DCOCON_DCOFSEL0_LENGTH                  0x00000001

#define _DCOCON_DCOFSEL1_POSITION                0x00000009
#define _DCOCON_DCOFSEL1_MASK                    0x00000200
#define _DCOCON_DCOFSEL1_LENGTH                  0x00000001

#define _DCOCON_DCOFSEL2_POSITION                0x0000000A
#define _DCOCON_DCOFSEL2_MASK                    0x00000400
#define _DCOCON_DCOFSEL2_LENGTH                  0x00000001

#define _DCOCON_DCOFSEL3_POSITION                0x0000000B
#define _DCOCON_DCOFSEL3_MASK                    0x00000800
#define _DCOCON_DCOFSEL3_LENGTH                  0x00000001

#define _OSCDIV_DIV_POSITION                     0x00000000
#define _OSCDIV_DIV_MASK                         0x00007FFF
#define _OSCDIV_DIV_LENGTH                       0x0000000F

#define _OSCDIV_DIV0_POSITION                    0x00000000
#define _OSCDIV_DIV0_MASK                        0x00000001
#define _OSCDIV_DIV0_LENGTH                      0x00000001

#define _OSCDIV_DIV1_POSITION                    0x00000001
#define _OSCDIV_DIV1_MASK                        0x00000002
#define _OSCDIV_DIV1_LENGTH                      0x00000001

#define _OSCDIV_DIV2_POSITION                    0x00000002
#define _OSCDIV_DIV2_MASK                        0x00000004
#define _OSCDIV_DIV2_LENGTH                      0x00000001

#define _OSCDIV_DIV3_POSITION                    0x00000003
#define _OSCDIV_DIV3_MASK                        0x00000008
#define _OSCDIV_DIV3_LENGTH                      0x00000001

#define _OSCDIV_DIV4_POSITION                    0x00000004
#define _OSCDIV_DIV4_MASK                        0x00000010
#define _OSCDIV_DIV4_LENGTH                      0x00000001

#define _OSCDIV_DIV5_POSITION                    0x00000005
#define _OSCDIV_DIV5_MASK                        0x00000020
#define _OSCDIV_DIV5_LENGTH                      0x00000001

#define _OSCDIV_DIV6_POSITION                    0x00000006
#define _OSCDIV_DIV6_MASK                        0x00000040
#define _OSCDIV_DIV6_LENGTH                      0x00000001

#define _OSCDIV_DIV7_POSITION                    0x00000007
#define _OSCDIV_DIV7_MASK                        0x00000080
#define _OSCDIV_DIV7_LENGTH                      0x00000001

#define _OSCDIV_DIV8_POSITION                    0x00000008
#define _OSCDIV_DIV8_MASK                        0x00000100
#define _OSCDIV_DIV8_LENGTH                      0x00000001

#define _OSCDIV_DIV9_POSITION                    0x00000009
#define _OSCDIV_DIV9_MASK                        0x00000200
#define _OSCDIV_DIV9_LENGTH                      0x00000001

#define _OSCDIV_DIV10_POSITION                   0x0000000A
#define _OSCDIV_DIV10_MASK                       0x00000400
#define _OSCDIV_DIV10_LENGTH                     0x00000001

#define _OSCDIV_DIV11_POSITION                   0x0000000B
#define _OSCDIV_DIV11_MASK                       0x00000800
#define _OSCDIV_DIV11_LENGTH                     0x00000001

#define _OSCDIV_DIV12_POSITION                   0x0000000C
#define _OSCDIV_DIV12_MASK                       0x00001000
#define _OSCDIV_DIV12_LENGTH                     0x00000001

#define _OSCDIV_DIV13_POSITION                   0x0000000D
#define _OSCDIV_DIV13_MASK                       0x00002000
#define _OSCDIV_DIV13_LENGTH                     0x00000001

#define _OSCDIV_DIV14_POSITION                   0x0000000E
#define _OSCDIV_DIV14_MASK                       0x00004000
#define _OSCDIV_DIV14_LENGTH                     0x00000001

#define _OSCFDIV_TRIM_POSITION                   0x00000007
#define _OSCFDIV_TRIM_MASK                       0x0000FF80
#define _OSCFDIV_TRIM_LENGTH                     0x00000009

