MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB610/mcu.h
#define _LATA_LATA4_POSITION                     0x00000004
#define _LATA_LATA4_MASK                         0x00000010
#define _LATA_LATA4_LENGTH                       0x00000001

#define _LATA_LATA5_POSITION                     0x00000005
#define _LATA_LATA5_MASK                         0x00000020
#define _LATA_LATA5_LENGTH                       0x00000001

#define _LATA_LATA6_POSITION                     0x00000006
#define _LATA_LATA6_MASK                         0x00000040
#define _LATA_LATA6_LENGTH                       0x00000001

#define _LATA_LATA7_POSITION                     0x00000007
#define _LATA_LATA7_MASK                         0x00000080
#define _LATA_LATA7_LENGTH                       0x00000001

#define _LATA_LATA9_POSITION                     0x00000009
#define _LATA_LATA9_MASK                         0x00000200
#define _LATA_LATA9_LENGTH                       0x00000001

#define _LATA_LATA10_POSITION                    0x0000000A
#define _LATA_LATA10_MASK                        0x00000400
#define _LATA_LATA10_LENGTH                      0x00000001

#define _LATA_LATA14_POSITION                    0x0000000E
#define _LATA_LATA14_MASK                        0x00004000
#define _LATA_LATA14_LENGTH                      0x00000001

#define _LATA_LATA15_POSITION                    0x0000000F
#define _LATA_LATA15_MASK                        0x00008000
#define _LATA_LATA15_LENGTH                      0x00000001

#define _ODCA_ODCA0_POSITION                     0x00000000
#define _ODCA_ODCA0_MASK                         0x00000001
#define _ODCA_ODCA0_LENGTH                       0x00000001

#define _ODCA_ODCA1_POSITION                     0x00000001
#define _ODCA_ODCA1_MASK                         0x00000002
#define _ODCA_ODCA1_LENGTH                       0x00000001

#define _ODCA_ODCA2_POSITION                     0x00000002
#define _ODCA_ODCA2_MASK                         0x00000004
#define _ODCA_ODCA2_LENGTH                       0x00000001

#define _ODCA_ODCA3_POSITION                     0x00000003
#define _ODCA_ODCA3_MASK                         0x00000008
#define _ODCA_ODCA3_LENGTH                       0x00000001

#define _ODCA_ODCA4_POSITION                     0x00000004
#define _ODCA_ODCA4_MASK                         0x00000010
#define _ODCA_ODCA4_LENGTH                       0x00000001

#define _ODCA_ODCA5_POSITION                     0x00000005
#define _ODCA_ODCA5_MASK                         0x00000020
#define _ODCA_ODCA5_LENGTH                       0x00000001

#define _ODCA_ODCA6_POSITION                     0x00000006
#define _ODCA_ODCA6_MASK                         0x00000040
#define _ODCA_ODCA6_LENGTH                       0x00000001

#define _ODCA_ODCA7_POSITION                     0x00000007
#define _ODCA_ODCA7_MASK                         0x00000080
#define _ODCA_ODCA7_LENGTH                       0x00000001

#define _ODCA_ODCA9_POSITION                     0x00000009
#define _ODCA_ODCA9_MASK                         0x00000200
#define _ODCA_ODCA9_LENGTH                       0x00000001

#define _ODCA_ODCA10_POSITION                    0x0000000A
#define _ODCA_ODCA10_MASK                        0x00000400
#define _ODCA_ODCA10_LENGTH                      0x00000001

#define _ODCA_ODCA14_POSITION                    0x0000000E
#define _ODCA_ODCA14_MASK                        0x00004000
#define _ODCA_ODCA14_LENGTH                      0x00000001

#define _ODCA_ODCA15_POSITION                    0x0000000F
#define _ODCA_ODCA15_MASK                        0x00008000
#define _ODCA_ODCA15_LENGTH                      0x00000001

#define _ANSA_ANSA6_POSITION                     0x00000006
#define _ANSA_ANSA6_MASK                         0x00000040
#define _ANSA_ANSA6_LENGTH                       0x00000001

#define _ANSA_ANSA7_POSITION                     0x00000007
#define _ANSA_ANSA7_MASK                         0x00000080
#define _ANSA_ANSA7_LENGTH                       0x00000001

#define _ANSA_ANSA9_POSITION                     0x00000009
#define _ANSA_ANSA9_MASK                         0x00000200
#define _ANSA_ANSA9_LENGTH                       0x00000001

#define _ANSA_ANSA10_POSITION                    0x0000000A
#define _ANSA_ANSA10_MASK                        0x00000400
#define _ANSA_ANSA10_LENGTH                      0x00000001

#define _ANSA_ANSELA6_POSITION                   0x00000006
#define _ANSA_ANSELA6_MASK                       0x00000040
#define _ANSA_ANSELA6_LENGTH                     0x00000001

#define _ANSA_ANSELA7_POSITION                   0x00000007
#define _ANSA_ANSELA7_MASK                       0x00000080
#define _ANSA_ANSELA7_LENGTH                     0x00000001

#define _ANSA_ANSELA9_POSITION                   0x00000009
#define _ANSA_ANSELA9_MASK                       0x00000200
#define _ANSA_ANSELA9_LENGTH                     0x00000001

#define _ANSA_ANSELA10_POSITION                  0x0000000A
#define _ANSA_ANSELA10_MASK                      0x00000400
#define _ANSA_ANSELA10_LENGTH                    0x00000001

#define _ANSELA_ANSA6_POSITION                   0x00000006
#define _ANSELA_ANSA6_MASK                       0x00000040
#define _ANSELA_ANSA6_LENGTH                     0x00000001

#define _ANSELA_ANSA7_POSITION                   0x00000007
#define _ANSELA_ANSA7_MASK                       0x00000080
#define _ANSELA_ANSA7_LENGTH                     0x00000001

#define _ANSELA_ANSA9_POSITION                   0x00000009
#define _ANSELA_ANSA9_MASK                       0x00000200
#define _ANSELA_ANSA9_LENGTH                     0x00000001

#define _ANSELA_ANSA10_POSITION                  0x0000000A
#define _ANSELA_ANSA10_MASK                      0x00000400
#define _ANSELA_ANSA10_LENGTH                    0x00000001

#define _ANSELA_ANSELA6_POSITION                 0x00000006
#define _ANSELA_ANSELA6_MASK                     0x00000040
#define _ANSELA_ANSELA6_LENGTH                   0x00000001

#define _ANSELA_ANSELA7_POSITION                 0x00000007
#define _ANSELA_ANSELA7_MASK                     0x00000080
#define _ANSELA_ANSELA7_LENGTH                   0x00000001

#define _ANSELA_ANSELA9_POSITION                 0x00000009
#define _ANSELA_ANSELA9_MASK                     0x00000200
#define _ANSELA_ANSELA9_LENGTH                   0x00000001

#define _ANSELA_ANSELA10_POSITION                0x0000000A
#define _ANSELA_ANSELA10_MASK                    0x00000400
#define _ANSELA_ANSELA10_LENGTH                  0x00000001

#define _IOCPA_IOCPA0_POSITION                   0x00000000
#define _IOCPA_IOCPA0_MASK                       0x00000001
#define _IOCPA_IOCPA0_LENGTH                     0x00000001

#define _IOCPA_IOCPA1_POSITION                   0x00000001
#define _IOCPA_IOCPA1_MASK                       0x00000002
#define _IOCPA_IOCPA1_LENGTH                     0x00000001

