MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB610/mcu.h
#define _ODCD_ODCD11_POSITION                    0x0000000B
#define _ODCD_ODCD11_MASK                        0x00000800
#define _ODCD_ODCD11_LENGTH                      0x00000001

#define _ODCD_ODCD12_POSITION                    0x0000000C
#define _ODCD_ODCD12_MASK                        0x00001000
#define _ODCD_ODCD12_LENGTH                      0x00000001

#define _ODCD_ODCD13_POSITION                    0x0000000D
#define _ODCD_ODCD13_MASK                        0x00002000
#define _ODCD_ODCD13_LENGTH                      0x00000001

#define _ODCD_ODCD14_POSITION                    0x0000000E
#define _ODCD_ODCD14_MASK                        0x00004000
#define _ODCD_ODCD14_LENGTH                      0x00000001

#define _ODCD_ODCD15_POSITION                    0x0000000F
#define _ODCD_ODCD15_MASK                        0x00008000
#define _ODCD_ODCD15_LENGTH                      0x00000001

#define _ANSD_ANSD6_POSITION                     0x00000006
#define _ANSD_ANSD6_MASK                         0x00000040
#define _ANSD_ANSD6_LENGTH                       0x00000001

#define _ANSD_ANSD7_POSITION                     0x00000007
#define _ANSD_ANSD7_MASK                         0x00000080
#define _ANSD_ANSD7_LENGTH                       0x00000001

#define _ANSD_ANSELD6_POSITION                   0x00000006
#define _ANSD_ANSELD6_MASK                       0x00000040
#define _ANSD_ANSELD6_LENGTH                     0x00000001

#define _ANSD_ANSELD7_POSITION                   0x00000007
#define _ANSD_ANSELD7_MASK                       0x00000080
#define _ANSD_ANSELD7_LENGTH                     0x00000001

#define _ANSELD_ANSD6_POSITION                   0x00000006
#define _ANSELD_ANSD6_MASK                       0x00000040
#define _ANSELD_ANSD6_LENGTH                     0x00000001

#define _ANSELD_ANSD7_POSITION                   0x00000007
#define _ANSELD_ANSD7_MASK                       0x00000080
#define _ANSELD_ANSD7_LENGTH                     0x00000001

#define _ANSELD_ANSELD6_POSITION                 0x00000006
#define _ANSELD_ANSELD6_MASK                     0x00000040
#define _ANSELD_ANSELD6_LENGTH                   0x00000001

#define _ANSELD_ANSELD7_POSITION                 0x00000007
#define _ANSELD_ANSELD7_MASK                     0x00000080
#define _ANSELD_ANSELD7_LENGTH                   0x00000001

#define _IOCPD_IOCPD0_POSITION                   0x00000000
#define _IOCPD_IOCPD0_MASK                       0x00000001
#define _IOCPD_IOCPD0_LENGTH                     0x00000001

#define _IOCPD_IOCPD1_POSITION                   0x00000001
#define _IOCPD_IOCPD1_MASK                       0x00000002
#define _IOCPD_IOCPD1_LENGTH                     0x00000001

#define _IOCPD_IOCPD2_POSITION                   0x00000002
#define _IOCPD_IOCPD2_MASK                       0x00000004
#define _IOCPD_IOCPD2_LENGTH                     0x00000001

#define _IOCPD_IOCPD3_POSITION                   0x00000003
#define _IOCPD_IOCPD3_MASK                       0x00000008
#define _IOCPD_IOCPD3_LENGTH                     0x00000001

#define _IOCPD_IOCPD4_POSITION                   0x00000004
#define _IOCPD_IOCPD4_MASK                       0x00000010
#define _IOCPD_IOCPD4_LENGTH                     0x00000001

#define _IOCPD_IOCPD5_POSITION                   0x00000005
#define _IOCPD_IOCPD5_MASK                       0x00000020
#define _IOCPD_IOCPD5_LENGTH                     0x00000001

#define _IOCPD_IOCPD6_POSITION                   0x00000006
#define _IOCPD_IOCPD6_MASK                       0x00000040
#define _IOCPD_IOCPD6_LENGTH                     0x00000001

#define _IOCPD_IOCPD7_POSITION                   0x00000007
#define _IOCPD_IOCPD7_MASK                       0x00000080
#define _IOCPD_IOCPD7_LENGTH                     0x00000001

#define _IOCPD_IOCPD8_POSITION                   0x00000008
#define _IOCPD_IOCPD8_MASK                       0x00000100
#define _IOCPD_IOCPD8_LENGTH                     0x00000001

#define _IOCPD_IOCPD9_POSITION                   0x00000009
#define _IOCPD_IOCPD9_MASK                       0x00000200
#define _IOCPD_IOCPD9_LENGTH                     0x00000001

#define _IOCPD_IOCPD10_POSITION                  0x0000000A
#define _IOCPD_IOCPD10_MASK                      0x00000400
#define _IOCPD_IOCPD10_LENGTH                    0x00000001

#define _IOCPD_IOCPD11_POSITION                  0x0000000B
#define _IOCPD_IOCPD11_MASK                      0x00000800
#define _IOCPD_IOCPD11_LENGTH                    0x00000001

#define _IOCPD_IOCPD12_POSITION                  0x0000000C
#define _IOCPD_IOCPD12_MASK                      0x00001000
#define _IOCPD_IOCPD12_LENGTH                    0x00000001

#define _IOCPD_IOCPD13_POSITION                  0x0000000D
#define _IOCPD_IOCPD13_MASK                      0x00002000
#define _IOCPD_IOCPD13_LENGTH                    0x00000001

#define _IOCPD_IOCPD14_POSITION                  0x0000000E
#define _IOCPD_IOCPD14_MASK                      0x00004000
#define _IOCPD_IOCPD14_LENGTH                    0x00000001

#define _IOCPD_IOCPD15_POSITION                  0x0000000F
#define _IOCPD_IOCPD15_MASK                      0x00008000
#define _IOCPD_IOCPD15_LENGTH                    0x00000001

#define _IOCND_IOCND0_POSITION                   0x00000000
#define _IOCND_IOCND0_MASK                       0x00000001
#define _IOCND_IOCND0_LENGTH                     0x00000001

#define _IOCND_IOCND1_POSITION                   0x00000001
#define _IOCND_IOCND1_MASK                       0x00000002
#define _IOCND_IOCND1_LENGTH                     0x00000001

#define _IOCND_IOCND2_POSITION                   0x00000002
#define _IOCND_IOCND2_MASK                       0x00000004
#define _IOCND_IOCND2_LENGTH                     0x00000001

#define _IOCND_IOCND3_POSITION                   0x00000003
#define _IOCND_IOCND3_MASK                       0x00000008
#define _IOCND_IOCND3_LENGTH                     0x00000001

#define _IOCND_IOCND4_POSITION                   0x00000004
#define _IOCND_IOCND4_MASK                       0x00000010
#define _IOCND_IOCND4_LENGTH                     0x00000001

#define _IOCND_IOCND5_POSITION                   0x00000005
#define _IOCND_IOCND5_MASK                       0x00000020
#define _IOCND_IOCND5_LENGTH                     0x00000001

#define _IOCND_IOCND6_POSITION                   0x00000006
#define _IOCND_IOCND6_MASK                       0x00000040
#define _IOCND_IOCND6_LENGTH                     0x00000001

