MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB610/mcu.h
#define _ANSELG_ANSG9_POSITION                   0x00000009
#define _ANSELG_ANSG9_MASK                       0x00000200
#define _ANSELG_ANSG9_LENGTH                     0x00000001

#define _ANSELG_ANSELG6_POSITION                 0x00000006
#define _ANSELG_ANSELG6_MASK                     0x00000040
#define _ANSELG_ANSELG6_LENGTH                   0x00000001

#define _ANSELG_ANSELG7_POSITION                 0x00000007
#define _ANSELG_ANSELG7_MASK                     0x00000080
#define _ANSELG_ANSELG7_LENGTH                   0x00000001

#define _ANSELG_ANSELG8_POSITION                 0x00000008
#define _ANSELG_ANSELG8_MASK                     0x00000100
#define _ANSELG_ANSELG8_LENGTH                   0x00000001

#define _ANSELG_ANSELG9_POSITION                 0x00000009
#define _ANSELG_ANSELG9_MASK                     0x00000200
#define _ANSELG_ANSELG9_LENGTH                   0x00000001

#define _ANSG_ANSG6_POSITION                     0x00000006
#define _ANSG_ANSG6_MASK                         0x00000040
#define _ANSG_ANSG6_LENGTH                       0x00000001

#define _ANSG_ANSG7_POSITION                     0x00000007
#define _ANSG_ANSG7_MASK                         0x00000080
#define _ANSG_ANSG7_LENGTH                       0x00000001

#define _ANSG_ANSG8_POSITION                     0x00000008
#define _ANSG_ANSG8_MASK                         0x00000100
#define _ANSG_ANSG8_LENGTH                       0x00000001

#define _ANSG_ANSG9_POSITION                     0x00000009
#define _ANSG_ANSG9_MASK                         0x00000200
#define _ANSG_ANSG9_LENGTH                       0x00000001

#define _ANSG_ANSELG6_POSITION                   0x00000006
#define _ANSG_ANSELG6_MASK                       0x00000040
#define _ANSG_ANSELG6_LENGTH                     0x00000001

#define _ANSG_ANSELG7_POSITION                   0x00000007
#define _ANSG_ANSELG7_MASK                       0x00000080
#define _ANSG_ANSELG7_LENGTH                     0x00000001

#define _ANSG_ANSELG8_POSITION                   0x00000008
#define _ANSG_ANSELG8_MASK                       0x00000100
#define _ANSG_ANSELG8_LENGTH                     0x00000001

#define _ANSG_ANSELG9_POSITION                   0x00000009
#define _ANSG_ANSELG9_MASK                       0x00000200
#define _ANSG_ANSELG9_LENGTH                     0x00000001

#define _IOCPG_IOCPG0_POSITION                   0x00000000
#define _IOCPG_IOCPG0_MASK                       0x00000001
#define _IOCPG_IOCPG0_LENGTH                     0x00000001

#define _IOCPG_IOCPG1_POSITION                   0x00000001
#define _IOCPG_IOCPG1_MASK                       0x00000002
#define _IOCPG_IOCPG1_LENGTH                     0x00000001

#define _IOCPG_IOCPG2_POSITION                   0x00000002
#define _IOCPG_IOCPG2_MASK                       0x00000004
#define _IOCPG_IOCPG2_LENGTH                     0x00000001

#define _IOCPG_IOCPG3_POSITION                   0x00000003
#define _IOCPG_IOCPG3_MASK                       0x00000008
#define _IOCPG_IOCPG3_LENGTH                     0x00000001

#define _IOCPG_IOCPG6_POSITION                   0x00000006
#define _IOCPG_IOCPG6_MASK                       0x00000040
#define _IOCPG_IOCPG6_LENGTH                     0x00000001

#define _IOCPG_IOCPG7_POSITION                   0x00000007
#define _IOCPG_IOCPG7_MASK                       0x00000080
#define _IOCPG_IOCPG7_LENGTH                     0x00000001

#define _IOCPG_IOCPG8_POSITION                   0x00000008
#define _IOCPG_IOCPG8_MASK                       0x00000100
#define _IOCPG_IOCPG8_LENGTH                     0x00000001

#define _IOCPG_IOCPG9_POSITION                   0x00000009
#define _IOCPG_IOCPG9_MASK                       0x00000200
#define _IOCPG_IOCPG9_LENGTH                     0x00000001

#define _IOCPG_IOCPG12_POSITION                  0x0000000C
#define _IOCPG_IOCPG12_MASK                      0x00001000
#define _IOCPG_IOCPG12_LENGTH                    0x00000001

#define _IOCPG_IOCPG13_POSITION                  0x0000000D
#define _IOCPG_IOCPG13_MASK                      0x00002000
#define _IOCPG_IOCPG13_LENGTH                    0x00000001

#define _IOCPG_IOCPG14_POSITION                  0x0000000E
#define _IOCPG_IOCPG14_MASK                      0x00004000
#define _IOCPG_IOCPG14_LENGTH                    0x00000001

#define _IOCPG_IOCPG15_POSITION                  0x0000000F
#define _IOCPG_IOCPG15_MASK                      0x00008000
#define _IOCPG_IOCPG15_LENGTH                    0x00000001

#define _IOCNG_IOCNG0_POSITION                   0x00000000
#define _IOCNG_IOCNG0_MASK                       0x00000001
#define _IOCNG_IOCNG0_LENGTH                     0x00000001

#define _IOCNG_IOCNG1_POSITION                   0x00000001
#define _IOCNG_IOCNG1_MASK                       0x00000002
#define _IOCNG_IOCNG1_LENGTH                     0x00000001

#define _IOCNG_IOCNG2_POSITION                   0x00000002
#define _IOCNG_IOCNG2_MASK                       0x00000004
#define _IOCNG_IOCNG2_LENGTH                     0x00000001

#define _IOCNG_IOCNG3_POSITION                   0x00000003
#define _IOCNG_IOCNG3_MASK                       0x00000008
#define _IOCNG_IOCNG3_LENGTH                     0x00000001

#define _IOCNG_IOCNG6_POSITION                   0x00000006
#define _IOCNG_IOCNG6_MASK                       0x00000040
#define _IOCNG_IOCNG6_LENGTH                     0x00000001

#define _IOCNG_IOCNG7_POSITION                   0x00000007
#define _IOCNG_IOCNG7_MASK                       0x00000080
#define _IOCNG_IOCNG7_LENGTH                     0x00000001

#define _IOCNG_IOCNG8_POSITION                   0x00000008
#define _IOCNG_IOCNG8_MASK                       0x00000100
#define _IOCNG_IOCNG8_LENGTH                     0x00000001

#define _IOCNG_IOCNG9_POSITION                   0x00000009
#define _IOCNG_IOCNG9_MASK                       0x00000200
#define _IOCNG_IOCNG9_LENGTH                     0x00000001

#define _IOCNG_IOCNG12_POSITION                  0x0000000C
#define _IOCNG_IOCNG12_MASK                      0x00001000
#define _IOCNG_IOCNG12_LENGTH                    0x00000001

#define _IOCNG_IOCNG13_POSITION                  0x0000000D
#define _IOCNG_IOCNG13_MASK                      0x00002000
#define _IOCNG_IOCNG13_LENGTH                    0x00000001

#define _IOCNG_IOCNG14_POSITION                  0x0000000E
#define _IOCNG_IOCNG14_MASK                      0x00004000
#define _IOCNG_IOCNG14_LENGTH                    0x00000001

#define _IOCNG_IOCNG15_POSITION                  0x0000000F
#define _IOCNG_IOCNG15_MASK                      0x00008000
#define _IOCNG_IOCNG15_LENGTH                    0x00000001

#define _IOCFG_IOCFG0_POSITION                   0x00000000
#define _IOCFG_IOCFG0_MASK                       0x00000001
#define _IOCFG_IOCFG0_LENGTH                     0x00000001

#define _IOCFG_IOCFG1_POSITION                   0x00000001
#define _IOCFG_IOCFG1_MASK                       0x00000002
#define _IOCFG_IOCFG1_LENGTH                     0x00000001

