MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB610/mcu.h
/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     PGX3                 Communicate on PGEC3 and PGED3
**     PGX2                 Communicate on PGEC2 and PGED2
**     PGX1                 Communicate on PGEC1 and PGED1
**     ICS_PGX1             Communicate on PGEC1 and PGED1
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
**   BOOTSWP Disable:
**     BTSWP_ON             BOOTSWP instruction is enabled
**     BTSWP_OFF            BOOTSWP instruction disabled
**
*/

#define ICS_NONE             0x80A0
#define PGX3                 0x80A1
#define PGX2                 0x80A2
#define PGX1                 0x80A3
#define ICS_PGX1             0x80A3

#define JTAGEN_OFF           0x8083
#define JTAGEN_ON            0x80A3

#define BTSWP_ON             0x00A3
#define BTSWP_OFF            0x80A3

/* Register FDEVOPT1 (0x2af2c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT1;
#define _FDEVOPT1(x) __attribute__((address(0x2af2c),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT1.sec"),space(prog))) __prog__ uint16_t _FDEVOPT1 = (x);

/*
** Only one invocation of FDEVOPT1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT1.
** Multiple options may be combined, as shown:
**
** _FDEVOPT1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Alternate Comparator Input Enable bit:
**     ALTCMPI_ENABLE       C1INC, C2INC and C3INC are on RG9
**     ALTCMPI_DISABLE      C1INC, C2INC, and C3INC are on their standard pin locations
**
**   Tamper Pin Enable bit:
**     TMPRPIN_ON           TMPRN pin function is enabled
**     TMPRPIN_OFF          TMPRN pin function is disabled
**
**   SOSC High Power Enable bit (valid only when SOSCSEL = 1:
**     SOSCHP_OFF           Enable SOSC low power mode
**     SOSCHP_ON            Enable SOSC high power mode (default)
**
**   Alternate Voltage Reference Location Enable bit:
**     ALTVREF_ALTVREFDIS   VREF+ and CVREF+ on RB0, VREF- and CVREF- on RB1
**     ALTVREF_ALTREFEN     VREF+ and CVREF+ on RA10, VREF- and CVREF- on RA9
**
*/

#define ALTCMPI_ENABLE       0x001C
#define ALTCMPI_DISABLE      0x001E

#define TMPRPIN_ON           0x001A
#define TMPRPIN_OFF          0x001E

#define SOSCHP_OFF           0x0016
#define SOSCHP_ON            0x001E

#define ALTVREF_ALTVREFDIS   0x000E
#define ALTVREF_ALTREFEN     0x001E

/* Register FBTSEQ (0x2affc)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBTSEQ;
#define _FBTSEQ(x) __attribute__((address(0x2affc),deprecated_definition("consider migrating to #pragma config"),section("__FBTSEQ.sec"),space(prog))) __prog__ uint16_t _FBTSEQ = (x);

/*
** Only one invocation of FBTSEQ should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBTSEQ.
** Multiple options may be combined, as shown:
**
** _FBTSEQ( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Relative value defining which partition will be active after device Reset; the partition containing a lower boot number will be active:
**
**   The one's complement of BSEQ; must be calculated by the user and written during device programming.:
**
*/



#endif



/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x400

#undef _FLASH_ROW
#define _FLASH_ROW 0x80

/*
 * Memory Segments Sizes
 */


/*
 * Memory Segments Sizes that are always present
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __FBOOT_BASE 0x801800
#define __FBOOT_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x7800

#define __EDS_BASE 0x8000
#define __EDS_LENGTH 0x800


/*
 * Single panel memory sizes
 */

#ifndef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0x55e00

#define __FSEC_BASE 0x55f00
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x55f10
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x55f14
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x55f18
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x55f1c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x55f20
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x55f24
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x55f28
#define __FICD_LENGTH 0x2

#define __FDEVOPT1_BASE 0x55f2c
#define __FDEVOPT1_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x7800

#define __EDS_BASE 0x8000
#define __EDS_LENGTH 0x800


/*
 * Dual panel memory sizes
 */

#ifdef __DUAL_PARTITION
#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0x2ae00

#define __FSEC_BASE 0x2af00
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0x2af10
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0x2af14
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0x2af18
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0x2af1c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0x2af20
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0x2af24
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0x2af28
#define __FICD_LENGTH 0x2

#define __FDEVOPT1_BASE 0x2af2c
#define __FDEVOPT1_LENGTH 0x2

#define __FBTSEQ_BASE 0x2affc
#define __FBTSEQ_LENGTH 0x2

#endif

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x7800

#define __EDS_BASE 0x8000
#define __EDS_LENGTH 0x800


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_C1OUT 1
#define _RPOUT_C2OUT 2
#define _RPOUT_U1TX 3
#define _RPOUT_U1RTS 4
#define _RPOUT_U2TX 5
#define _RPOUT_U2RTS 6
#define _RPOUT_SDO1 7
#define _RPOUT_SCK1OUT 8
#define _RPOUT_SS1OUT 9
#define _RPOUT_SDO2 10
#define _RPOUT_SCK2OUT 11
#define _RPOUT_SS2OUT 12
#define _RPOUT_OC1 13
#define _RPOUT_OC2 14
#define _RPOUT_OC3 15
#define _RPOUT_OCM4 16
#define _RPOUT_OCM5 17
#define _RPOUT_OCM6 18
#define _RPOUT_U3TX 19
#define _RPOUT_U3RTS 20
#define _RPOUT_U4TX 21
#define _RPOUT_U4RTS 22
#define _RPOUT_SDO3 23
#define _RPOUT_SCK3OUT 24
#define _RPOUT_SS3OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_OCM7 27
#define _RPOUT_REFO 28
#define _RPOUT_CLC1OUT 29
#define _RPOUT_CLC2OUT 30
#define _RPOUT_RTCC 31

#endif
